Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.AnalysisPartBarAttributes Property
 The analysis part bar attributes.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisPartBarAttributes AnalysisPartBarAttributes { get; set; }
Public Property AnalysisPartBarAttributes As AnalysisPartBarAttributes
	Get
	Set
Property Value
Type: AnalysisPartBarAttributes
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace